import React from "react";

const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy">
      <h1>سياسة الخصوصية</h1>
      <p>
        نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم
        إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها
        منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه
        البيانات الشخصية.
      </p>
      <h3>التصفح</h3>
      <p>
        لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من جهاز الكمبيوتر
        الخاص بك أثناء تصفحك لهذا الموقع, وإنما سيتم فقط استخدام البيانات
        المقدمة من قبلك بمعرفتك ومحض إرادتك.
      </p>
      <h3>عنوان بروتوكول شبكة الإنترنت (IP)</h3>
      <p>
        سيقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك,
        تاريخ ووقت الزيارة ونوع متصفح الإنترنت الذي تستخدمه، والعنوان URL الخاص
        بأي موقع من مواقع الإنترنت التي تقوم بإحالتك إلى هذا الموقع على الشبكة.
      </p>
      <h3>عمليات المسح على الشبكة</h3>
      <p>
        إن عمليات المسح التي نقوم بها مباشرة على الشبكة تمكننا من تجميع بيانات
        محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا. تعتبر
        ردودك ذات أهمية قصوى, ومحل تقديرنا،ىىى حيث أنها تمكننا من تحسين مستوى
        موقعنا, ولك كامل الحرية والاختيار في تقديم البيانات المتعلقة باسمك
        والبيانات الأخرى.
      </p>
      <h3>الروابط بالمواقع الأخرى على شبكة الإنترنت</h3>
      <p>
        قد يشتمل موقعنا على روابط بالمواقع الأخرى على شبكة الإنترنت، أو إعلانات
        من مواقع أخرى مثل Google AdSense ، ولا نعتبر مسئولين عن أساليب تجميع
        البيانات من قبل تلك المواقع, يمكنك الاطلاع على سياسات السرية والمحتويات
        الخاصة بتلك المواقع التي يتم الدخول إليها من خلال أي رابط ضمن هذا
        الموقع.
      </p>
      <p>
        قد نستعين بشركات إعلان لأطراف ثالثة لعرض الإعلانات عندما تزور موقعنا على
        الويب. يحق لهذه الشركات أن تستخدم معلومات حول زياراتك لهذا الموقع
        ولمواقع الويب الأخرى (باستثناء الاسم أو العنوان أو عنوان البريد
        الإلكتروني أو رقم الهاتف)، وذلك من أجل تقديم إعلانات حول البضائع
        والخدمات التي تهمك. إذا كنت ترغب في مزيد من المعلومات حول هذا الأمر وكنت
        تريد معرفة الاختيارات المتاحة لك لمنع استخدام هذه المعلومات من قِبل هذه
        الشركات ، فالرجاء النقر هنا.
      </p>
      <h3>إفشاء المعلومات</h3>
      <p>
        سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل
        عليها. ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي
        قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو
        مرغوباً فيه للتمشي مع القانون, أو للدفاع عن أو حماية حقوق الملكية الخاصة
        بهذا الموقع أو الجهات المستفيدة منه.
      </p>
      <h3>البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك</h3>
      <p>
        عندما نحتاج إلى أية بيانات خاصة بك, فإننا سنطلب منك تقديمها بمحض إرادتك.
        حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك
        ممكنناً. لن يتم اطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث
        بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما
        لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية
        والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك.
      </p>
      <h3>عند الاتصال بنا</h3>
      <p>
        سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية . تتطلب
        النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي ستساعدنا
        في تحسين موقعنا. سيتم استخدام البيانات التي يتم تقديمها من قبلك في الرد
        على كافة استفساراتك , ملاحظاتك , أو طلباتك من قبل هذا الموقع أو أيا من
        المواقع التابعة له .
      </p>
      <h3>إفشاء المعلومات لأي طرف ثالث</h3>
      <p>
        لن نقوم ببيع, المتاجرة, تأجير, أو إفشاء أية معلومات لمصلحة أي طرف ثالث
        خارج هذا الموقع, أو المواقع التابعة له. وسيتم الكشف عن المعلومات فقط في
        حالة صدور أمر بذلك من قبل أي سلطة قضائية أو تنظيمية.
      </p>
      <h3>التعديلات على سياسة سرية وخصوصية المعلومات</h3>
      <p>
        نحتفظ بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم
        الأمر ومتى كان ذلك ملائماً. سيتم تنفيذ التعديلات هنا أو على صفحة سياسة
        الخصوصية الرئيسية وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا عليها ,
        وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات.
      </p>
      <p>
        <strong>
          إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية
          الأهمية بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك من خلال هذه السياسة.
        </strong>
      </p>
    </div>
  );
};

export default PrivacyPolicy;
