import React from "react";
import { Link } from "react-router-dom";

const TermsOfUse = () => {
  return (
    <div className="terms-of-use">
      <h1>اتفاقية الاستخدام</h1>
      <p>
        من خلال استخدامك Hacking Technology فإنك توافق على الالتزام بالشروط
        والأحكام المنصوص عليها، لذا يجب عليك الاطلاع على هذه الأحكام وأخدها بعين
        الاعتبار:
      </p>
      <h3>قبول الاتفاقية</h3>
      <p>
        من خلال استخدامك لهذا الموقع، فهذا يشير إلى موافقتك الكاملة على قبول
        جميع الشروط والأحكام الواردة هنا. يجب عدم استخدام هذا الموقع في حال كنت
        غير موافق على أي من هذه الشروط والأحكام القياسية. تم إنشاء الشروط
        والأحكام الخاصة بنا في نموذج الشروط والأحكام ونموذج سياسة الخصوصية.
      </p>
      <p>يمنع استخدام هذا الموقع لمن تقل أعمارهم عن 18 عام.</p>
      <h3>حقوق الملكية الفردية</h3>
      <p>
        جميع العلامات التجارية التي تعرض على هذا الموقع هي ملك خاص له. وأيضا
        كافة المحتوى المعروض على هذا الموقع من صور وموسيقى ورسوم وغيرها هي ملك
        حصري للموقع لا يمكن استخدامها قبل الحصول على إذن من مالك الموقع.
      </p>
      <p>
        نحن نقدم لك صلاحية تصفح الموقع وإعادة استخدام بعض المحتوى لأغراض شخصية
        فقط ولا يجوز بأي شكل من الأشكال استخدام الموقع لأغراض تجارية أو دمج
        الموقع مع موقع أخر وفي حال قيام أحد الأشخاص أو المواقع بها فإنه سيتعرض
        للمساءلة القانونية.
      </p>
      <h3>القيود</h3>
      <p>في حال استخدامك لهذا الموقع يمنع عليك أن تقوم بما يلي:</p>
      <ul>
        <li> استخدام الموقع بطريقة غير قانونية أو مخالفة سياسة الخصوصية.</li>
        <li>
          القيام بأي سلوك من شأنه تعطيل أو إتلاف أو إلحاق الضرر بالموقع والتداخل
          مع العمل أو المحتوى الخاص للموقع أو مع استخدام أي شخص آخر.
        </li>
        <li>
          استخدام هذا الموقع لغرض الإعلان أو التسويق أو الدعاية دون أخذ إذن مسبق
          من مالك الموقع.
        </li>
        <li>
          نشر الكراهية أو العنصرية أو كلام بذيء أو التشهير بشخص أو بموقع حيث هذا
          يعرضك للمساءلة القانونية.
        </li>
        <li>
          إزالة إحدى الإشعارات الخاصة بحقوق الطبع والنشر أو أي اشعارات أخرى خاصة
          بحقوق الملكية الفكرية من الموقع أو بمحتوى متاح على الموقع أو عبره.
        </li>
      </ul>
      <p>إن قيامك بأي من النشاطات السابقة المخالفة لسياسة الموقع يعرضك للمسائلة القانونية.</p>
      <h3>إخلاء المسؤولية</h3>
      <p>إن وصولك الى الموقع واستخدامك للمحتوى الخاص به يقع على مسؤوليك الخاصة. حيث أن المعلومات التي نقدمها هي لأغراض المعلومات العامة فقط. ويتم توفير جميع المعلومات على الموقع بحسن نية. ومع ذلك، فإننا لا نقدم أي تعهد أو ضمان من أي نوع، صريحًا أو ضمنيًا، فيما يتعلق بدقة أو كفاية أو صحة أو موثوقية أو توفر أو اكتمال أي معلومات على الموقع.</p>
    <p>قد يتم تغيير هذه الاتفاقية من فترة إلى أخرى بما يراه الموقع مناسباً لأهدافه، لذا الرجاء مراجعتها والتقيّد بما فيها.</p>
    <h3>الخصوصية</h3>
    <p>
      الرجاء قراءة 
    <Link to="/privacy-policy" className="privacy-policy-link mx-1 text-muted">
        سياسية الخصوصية 
    </Link>
    </p>
    </div>
  );
};

export default TermsOfUse;
