const months = {
  0: {
    ar: "يناير",
    en: "",
  },
  1: {
    ar: "فبراير",
    en: "",
  },
  2: {
    ar: "فبراير",
    en: "",
  },
  3: {
    ar: "أبريل",
    en: "",
  },
  4: {
    ar: "مايو",
    en: "",
  },
  5: {
    ar: "يونيه",
    en: "",
  },
  6: {
    ar: "يوليو",
    en: "",
  },
  7: {
    ar: "أغسطس",
    en: "",
  },
  8: {
    ar: "سبتمبر",
    en: "",
  },
  9: {
    ar: "أكتوبر",
    en: "",
  },
  10: {
    ar: "نوفمبر",
    en: "",
  },
  11: {
    ar: "ديسمبر",
    en: "",
  },
};

export default months;
